<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Packages the latest version of Understand.</string>
    <key>Identifier</key>
    <string>com.github.gerardkok.pkg.Understand</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Understand</string>
        <key>PKG_ID</key>
        <string>com.scitools.Understand</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0</string>
    <key>ParentRecipe</key>
    <string>com.github.gerardkok.download.Understand</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>This recipe will be removed on July 19, 2026.</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>app_path</key>
                <string>%pathname%/Understand.app</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
