<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.Python-PyMongo</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Python</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Python</string>
		<key>NAME</key>
		<string>Python-PyMongo</string>
		<key>PYTHON_PKG_NAME</key>
		<string>pymongo</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>PyMongo is a Python distribution containing tools for working with MongoDB, and is the recommended way to work with MongoDB from Python.</string>
			<key>developer</key>
			<string>MongoDB</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.gerardkok.munki.Python-package</string>
</dict>
</plist>
