<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the Puppet Development Kit and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.gerardkok.munki.pdk</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/PDK</string>
        <key>MUNKI_CATEGORY</key>
        <string>Developer</string>
        <key>NAME</key>
        <string>PDK</string>
 		<key>OS_VERSION</key>
		<string>10.12</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>The Puppet Development Kit (PDK) makes it easier than ever to develop and test Puppet modules by providing a simple, unified interface to a set of helpful tools for anyone who writes or consumes Puppet code.</string>
			<key>minimum_os_version</key>
			<string>%OS_VERSION%.0</string>
			<key>maximum_os_version</key>
			<string>%OS_VERSION%.99</string>
            <key>developer</key>
            <string>Puppet</string>
            <key>display_name</key>
            <string>Puppet5</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.gerardkok.download.pdk</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
