<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download recipe for Puppet.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.download.puppet</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Puppet5</string>
            <key>OS_VERSION</key>
		    <string>10.13</string>
            <key>URL</key>
            <string>https://downloads.puppetlabs.com/mac/puppet5</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.5.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>This recipe will be removed on July 19, 2026.</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%URL%/%OS_VERSION%/x86_64/puppet-agent-latest.dmg</string>
                    <key>filename</key>
                    <string>%NAME%.dmg</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/*.pkg</string>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: PUPPET LABS, INC. (VKGLGN2B6Y)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
