<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release version of ImageOptim and imports into Munki.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.munki.ImageOptim</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_CATEGORY</key>
            <string>Utilities</string>
            <key>NAME</key>
            <string>ImageOptim</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps</string>
            <key>pkginfo</key>
            <dict>
                <key>blocking_applications</key>
                <array>
                    <string>ImageOptim.app</string>
                </array>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>description</key>
                <string>ImageOptim is a free app that makes images take up less disk space and load faster, without sacrificing quality. It optimizes compression parameters, removes junk metadata and unnecessary color profiles.</string>
                <key>display_name</key>
                <string>ImageOptim</string>
                <key>developer</key>
                <string>ImageAlpha</string>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.3.0</string>
        <key>ParentRecipe</key>
        <string>com.github.gerardkok.download.ImageOptim</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>This recipe will be removed on July 19, 2026.</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiInstallsItemsCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>faux_root</key>
                    <string>%pkgroot%</string>
                    <key>installs_item_paths</key>
                    <array>
                        <string>/Applications/ImageOptim.app</string>
                    </array>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>DmgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>dmg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                    <key>dmg_root</key>
                    <string>%pkgroot%/Applications/</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%dmg_path%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PathDeleter</string>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%pkgroot%</string>
                    </array>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
