<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads Airfoil and imports into Munki.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.munki.airfoil</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/airfoil</string>
            <key>MUNKI_CATEGORY</key>
            <string>Media</string>
            <key>NAME</key>
            <string>Airfoil</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>description</key>
                <string>Wireless audio around your house.</string>
                <key>display_name</key>
                <string>Airfoil</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>postinstall_script</key>
                <string>#!/bin/sh
                    
# Installer of computer audio driver in app content's dir.
# Skip this step if OS version is unsupported by ACE because installation of
# driver would fail on such OS and entire package installation would fail..
os_ver=`sw_vers -productVersion`
if [[ "$os_ver" =~ 10.1[2345].* ]]; then
    echo "Installing ACE driver..."
    TARGET_LOCATION=`echo $2`
    ACEINSTALLER=${TARGET_LOCATION}/Applications/Airfoil.app/Contents/Resources/aceinstaller
    echo ${ACEINSTALLER}
    ${ACEINSTALLER} install --silent
else
    echo "ACE driver does not support macOS ${os_ver}. Skip installation."
fi
</string>
                <key>unattended_install</key>
                <true/>
                <key>developer</key>
                <string>Rogue Amoeba</string>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.gerardkok.download.airfoil</string>
        <key>Process</key>
        <array>
        <dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>This recipe will be removed on July 19, 2026.</string>
                </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%/Airfoil Satellite.app</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>DmgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%</string>
            </dict>
        </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%dmg_path%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
