<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest Clementine.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.download.Clementine</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Clementine</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.5.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>This recipe will soon be removed. Please remove it from your list of recipes.</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>GitHubReleasesInfoProvider</string>
                <key>Arguments</key>
                <dict>
                    <key>asset_regex</key>
                    <string>clementine-[0-9\.]+\.dmg</string>
                    <key>github_repo</key>
                    <string>clementine-player/Clementine</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%.dmg</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/clementine.app</string>
                    <key>requirement</key>
                    <string>identifier "org.clementine-player.clementine" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = CZ8XD8GTGZ</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
