<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Clementine.</string>
	<key>Identifier</key>
	<string>com.github.gerardkok.download.Clementine</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Clementine</string>
		<key>SPARKLE_FEED_URL</key>
        <string>https://clementine-data.appspot.com/sparkle</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>Process</key>
	<array>
    	<dict>
        	<key>Processor</key>
        	<string>SparkleUpdateInfoProvider</string>
        	<key>Arguments</key>
        	<dict>
            	<key>appcast_url</key>
            	<string>%SPARKLE_FEED_URL%</string>
        	</dict>
    		</dict>
    		<dict>
        		<key>Processor</key>
        		<string>URLDownloader</string>
        		<key>Arguments</key>
        		<dict>
            		<key>filename</key>
            		<string>%NAME%.dmg</string>
        		</dict>
    		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
