<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Clementine and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.gerardkok.munki.Clementine</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Clementine</string>
        <key>NAME</key>
        <string>Clementine</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Clementine is a modern music player and library organizer.</string>
            <key>display_name</key>
            <string>Clementine</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>items_to_copy</key>
            <array>
                <dict>
                    <key>destination_path</key>
                    <string>/Applications</string>
                    <key>source_item</key>
                    <string>clementine.app</string>
                    <key>mode</key>
                    <string>go+rX</string>
                </dict>
            </array>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.gerardkok.download.Clementine</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>