<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Generic recipe to download a Python package and install it.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.install.Python-package</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Python-package</string>
            <key>PYTHON_PKG_NAME</key>
            <string>pypackage</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.gerardkok.pkg.Python-package</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pkgpath%</string>
                </dict>
                <key>Processor</key>
                <string>Installer</string>
            </dict>
        </array>
    </dict>
</plist>
