<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Generic recipe to create an installer for a Python package.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.pkg.Python-package</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Python-package</string>
            <key>PYTHON_PKG_NAME</key>
            <string>pypackage</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.gerardkok.download.Python-package</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>PkgRootCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>pkgdirs</key>
                    <dict>
                        <key>payload</key>
                        <string>0755</string>
                        <key>scripts</key>
                        <string>0755</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%pathname%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/scripts/%filename%</string>
                    <key>purge_destination</key>
                    <true/>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>FileCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>file_content</key>
                    <string>#!/bin/sh

working_dir=`/usr/bin/dirname "${0}"`
/usr/bin/easy_install "${working_dir}/%filename%"
</string>
                    <key>file_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/scripts/postinstall</string>
                    <key>file_mode</key>
                    <string>0755</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_request</key>
                    <dict>
                        <key>pkgroot</key>
                        <string>%RECIPE_CACHE_DIR%/%NAME%/payload</string>
                        <key>scripts</key>
                        <string>%RECIPE_CACHE_DIR%/%NAME%/scripts</string>
                        <key>pkgname</key>
                        <string>%PYTHON_PKG_NAME%</string>
                        <key>id</key>
                        <string>com.github.autopkg.gerardkok-recipes.%NAME%</string>
                        <key>version</key>
                        <string>%version%</string>
                        <key>options</key>
                        <string>purge_ds_store</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PathDeleter</string>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    </array>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
