<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads and installs the latest version of jq.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.install.jq</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>jq</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.gerardkok.pkg.jq</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>This recipe will be removed on July 19, 2026.</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pkg_path%</string>
                </dict>
                <key>Processor</key>
                <string>Installer</string>
            </dict>
        </array>
    </dict>
</plist>
