<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Builds a package that installs jq.</string>
	<key>Identifier</key>
	<string>com.github.gerardkok.pkg.jq</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>jq</string>
		<key>PKG_ID</key>
		<string>com.github.gerardkok.pkg.jq</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.gerardkok.verify.jq</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>payload</key>
					<string>0755</string>
					<key>payload/usr</key>
					<string>0755</string>
					<key>payload/usr/local</key>
					<string>0755</string>
					<key>payload/usr/local/bin</key>
					<string>0755</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/payload/usr/local/bin/jq</string>
				<key>source_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>mode</key>
							<string>0755</string>
							<key>path</key>
							<string>usr/local/bin/jq</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>force_pkg_build</key>
					<false/>
					<key>id</key>
					<string>%PKG_ID%</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<key>pkgname</key>
					<string>%NAME%-%fixedversion%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/payload</string>
					<key>version</key>
					<string>%fixedversion%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
