<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple Computer//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Builds a package that installs jq..</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.pkg.jq</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>jq</string>
            <key>PKG_ID</key>
            <string>com.github.gerardkok.pkg.jq</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.gerardkok.download.jq</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>VersionFixer</string>
                <key>Arguments</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgRootCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>pkgdirs</key>
                    <dict>
                        <key>scripts</key>
                        <string>0755</string>
                        <key>payload</key>
                        <string>0755</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%pathname%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/payload/%NAME%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>FileCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>file_content</key>
                    <string>#!/bin/sh

working_dir=`/usr/bin/dirname "${0}"`
cp "${working_dir}/jq" /usr/local/bin
chown root:admin /usr/local/bin/jq
chmod 755 /usr/local/bin/jq</string>
                    <key>file_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/scripts/postinstall</string>
                    <key>file_mode</key>
                    <string>0755</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_request</key>
                    <dict>
                        <key>pkgroot</key>
                        <string>%RECIPE_CACHE_DIR%/%NAME%/payload</string>
                        <key>scripts</key>
                        <string>%RECIPE_CACHE_DIR%/%NAME%/scripts</string>
                        <key>pkgdir</key>
                        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                        <key>pkgname</key>
                        <string>%NAME%-%fixedversion%</string>
                        <key>id</key>
                        <string>%PKG_ID%</string>
                        <key>version</key>
                        <string>%fixedversion%</string>
                        <key>options</key>
                        <string>purge_ds_store</string>
                        <key>chown</key>
                        <array/>
                    </dict>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
