<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Verify recipe for jq.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.verify.jq</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>jq</string>
            <key>KEYID</key>
            <string>0xAF19040C71523402</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.gerardkok.download.jq</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>com.github.autopkg.gerardkok-recipes.SharedProcessors/VersionFixer</string>
                <key>Arguments</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://github.com/stedolan/jq/raw/master/sig/v%fixedversion%/jq-osx-amd64.asc</string>
                    <key>filename</key>
                    <string>%NAME%.asc</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>com.github.autopkg.gerardkok-recipes.SharedProcessors/GPGSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>public_key_id</key>
                    <string>%KEYID%</string>
                    <key>distribution_file</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/%NAME%</string>
                    <key>signature_file</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.asc</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
