<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download recipe for the ownCloud desktop client.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.download.ownCloudDesktopClient</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>ownCloudDesktopClient</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>http://owncloud.org/install/</string>
                    <key>re_pattern</key>
                    <string>href=\"(https://download.owncloud.com/desktop/stable/ownCloud-[0-9\.]+.dmg)\"</string>
                    <key>result_output_var_name</key>
                    <string>download_url</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%download_url%</string>
                    <key>filename</key>
                    <string>%NAME%.dmg</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/ownCloud.app</string>
                    <key>requirement</key>
                    <string>identifier "com.owncloud.desktopclient" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "9B5WD74GWJ"</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
