<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads ClickShareLauncher and imports into Munki.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.munki.ClickShareLauncher</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/ClickShareLauncher</string>
            <key>MUNKI_CATEGORY</key>
            <string>Utilities</string>
            <key>NAME</key>
            <string>ClickShareLauncher</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>ClickShare is Barco's wireless presentation and collaboration system, that allows any meeting participant to share content on the central meeting room screen.</string>
                <key>developer</key>
                <string>Barco</string>
                <key>display_name</key>
                <string>ClickShare Launcher</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>minimum_os_version</key>
                <string>10.6.0</string>
                <key>unattended_install</key>
                <true/>
                <key>installer_choices_xml</key>
                <!--
                Disable the postflight script; this only opens the launcher
                -->
                <array>
                    <dict>
                        <key>attributeSetting</key>
                        <integer>0</integer>
                        <key>choiceAttribute</key>
                        <string>selected</string>
                        <key>choiceIdentifier</key>
                        <string>choice3</string>
                    </dict>
                </array>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.gerardkok.pkg.ClickShareLauncher</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pkg_path%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>
