<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Enpass and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.gerardkok.munki.enpass</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Enpass</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>MUNKI_CATEGORY</key>
        <string>Utilities</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>Enpass is an easy to use password-management app.</string>
            <key>developer</key>
            <string>Sinew Software Systems</string>
            <key>display_name</key>
            <string>Enpass</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.gerardkok.pkg.enpass</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>pkginfo</key>
                    <dict>
                        <key>version</key>
                        <string>%version%</string>
                        <key>receipts</key>
                        <array>
                            <dict>
                                <key>packageid</key>
                                <string>in.sinew.Enpass-Desktop.App</string>
                                <key>version</key>
                                <string>%version%</string>
                            </dict>
                        </array>
                    </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
