<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download recipe for GitFinder.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.download.gitfinder</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>GitFinder</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.5.0</string>
        <key>Process</key>
        <array>
           <dict>
              <key>Processor</key>
              <string>URLTextSearcher</string>
              <key>Arguments</key>
              <dict>
                  <key>url</key>
                  <string>https://zigz.ag/GitFinder/download</string>
                  <key>re_pattern</key>
                  <string>href="(?P&lt;url&gt;https://zigz\.ag/GitFinder/updates/GitFinder[a-z_]*\.dmg)"</string>
              </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%.dmg</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/GitFinder.app</string>
                    <key>requirement</key>
                    <string>anchor apple generic and identifier "ag.zigz.GitFinder" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = MQ76M469AB)</string>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
        </array>
    </dict>
</plist>
