<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads SplunkForwarder and imports in into Munki.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.munki.SplunkForwarder</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>support/SplunkForwarder</string>
            <key>MUNKI_CATEGORY</key>
            <string>Support</string>
            <key>NAME</key>
            <string>SplunkForwarder</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>Universal Forwarders provide reliable, secure data collection from remote sources and forward that data into Splunk (Enterprise, Light, Cloud or Hunk) for indexing and consolidation. They can scale to tens of thousands of remote systems, collecting terabytes of data with minimal impact on performance.</string>
                <key>developer</key>
                <string>Splunk Inc.</string>
                <key>display_name</key>
                <string>SplunkForwarder</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.gerardkok.pkg.SplunkForwarder</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pkg_path%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>
