<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Packages the latest version of Sequel Ace.</string>
    <key>Identifier</key>
    <string>com.github.gerardkok.pkg.SequelAce</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SequelAce</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.gerardkok.download.SequelAce</string>
    <key>Process</key>
    <array>
        <dict>           
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/unpacked/Sequel Ace.app/Contents/Info.plist</string>
             </dict>
        </dict>
        <dict>           
            <key>Processor</key>
            <string>AppPkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>app_path</key>
                <string>%RECIPE_CACHE_DIR%/unpacked/Sequel Ace.app</string>
             </dict>
        </dict>
    </array>
</dict>
</plist>
