<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download recipe for MongoDB.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.download.MongoDB</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>MongoDB</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.3.1</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://www.mongodb.org/downloads</string>
                    <key>re_pattern</key>
                    <string>&lt;h2&gt;Current Stable Release \(([0-9\.]+)\)&lt;/h2&gt;</string>
                    <key>result_output_var_name</key>
                    <string>version</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://fastdl.mongodb.org/osx/mongodb-osx-x86_64-%version%.tgz</string>
                    <key>filename</key>
                    <string>%NAME%.tgz</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
