<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Verify recipe for MongoDB.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.verify.MongoDB</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>MongoDB</string>
            <key>KEYID</key>
            <string>EA312927</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.gerardkok.download.MongoDB</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%url%.sig</string>
                    <key>filename</key>
                    <string>%NAME%.tgz.sig</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>com.github.autopkg.gerardkok-recipes.SharedProcessors/GPGSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>public_key_id</key>
                    <string>%KEYID%</string>
                    <key>distribution_file</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.tgz</string>
                    <key>signature_file</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.tgz.sig</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
