<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download recipe for MongoDB.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.download.MongoDB</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>MongoDB</string>
            <key>URL</key>
            <string>https://www.mongodb.com/try/download/community</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.3.1</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%URL%</string>
                    <key>re_pattern</key>
                    <string>\"macOS\":{\"tgz\":\"(?P&lt;url&gt;https://fastdl.mongodb.org/osx/mongodb-macos-x86_64-(?P&lt;version&gt;[0-9\.]+).tgz)\"}</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%.tgz</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
