<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download recipe for Postbox.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.download.Postbox</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Postbox</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.3.1</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://www.postbox-inc.com/download/success-mac</string>
                    <key>re_pattern</key>
                    <string>\"(https://s3\.amazonaws\.com/download\.getpostbox\.com/installers/.*\.dmg)\"</string>
                    <key>result_output_var_name</key>
                    <string>download_url</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%download_url%</string>
                    <key>filename</key>
                    <string>%NAME%.dmg</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/Postbox.app</string>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Application: Postbox, Inc. (A9QD7F9VSC)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
        </array>
    </dict>
</plist>