<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Microsoft's .NET Core SDK.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.download.DotNetCoreSDK</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>DotNetCoreSDK</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.3.1</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://www.microsoft.com/net/download</string>
                    <key>re_pattern</key>
                    <string>&lt;a\s+href=\"(https://go.microsoft.com/fwlink/\?LinkID=[0-9]*)\"&gt;x64&lt;/a&gt;\s+\.pkg&lt;/td&gt;</string>
                    <key>result_output_var_name</key>
                    <string>base_url</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>DotNetCoreSDKURLProvider</string>
                <key>Arguments</key>
                <dict>
                    <key>base_url</key>
                    <string>%base_url%</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%url%</string>
                    <key>filename</key>
                    <string>%NAME%.pkg</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%</string>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: Microsoft Corporation (UBF8T346G9)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
