<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Imports the latest release of Microsoft's .NET Core SDK into Munki.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.munki.DotNetCoreSDK</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/DotNetCoreSDK</string>
            <key>MUNKI_CATEGORY</key>
            <string>Development</string>
            <key>NAME</key>
            <string>DotNetCoreSDK</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>.NET Core is a general purpose development platform maintained by Microsoft and the .NET community on GitHub. It is cross-platform, supporting Windows, macOS and Linux, and can be used in device, cloud, and embedded/IoT scenarios.</string>
                <key>developer</key>
                <string>Microsoft</string>
                <key>display_name</key>
                <string>.NET Core SDK</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>2.7</string>
        <key>ParentRecipe</key>
        <string>com.github.gerardkok.download.DotNetCoreSDK</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>This recipe will soon be removed. Please remove it from your list of recipes.</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>version</key>
                        <string>%version%</string>
                    </dict>
                </dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>predicate</key>
                    <string>pkginfo_repo_path == ''</string>
                </dict>
                <key>Processor</key>
                <string>StopProcessingIf</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_ids_set_optional_true</key>
                    <array>
                        <string>com.microsoft.dotnet.sharedhost.component.osx.x64</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>MunkiOptionalReceiptEditor</string>
            </dict>
        </array>
    </dict>
</plist>
