<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads, verifies and installs the latest version of Node.js.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.install.node</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>node</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.gerardkok.verify.node</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                </dict>
                <key>Processor</key>
                <string>Installer</string>
            </dict>
        </array>
    </dict>
</plist>
