<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Verifies the SHA256 checksum of the latest version of Node.js.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.verify.node</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>node</string>
            <key>TYPE</key>
            <string>Stable</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.gerardkok.download.node</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://nodejs.org/dist/v%version%/SHASUMS256.txt</string>
                    <key>re_pattern</key>
                    <string>^([0-9a-f]+)\s+%NAME%-v%version%.pkg$</string>
                    <key>re_flags</key>
                    <array>
                        <string>MULTILINE</string>
                    </array>
                    <key>result_output_var_name</key>
                    <string>expected_sha256sum</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Sha256sumVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>pkgpath</key>
                    <string>%pathname%</string>
                    <key>expected_sha256sum</key>
                    <string>%expected_sha256sum%</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
