<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads Node.js and imports into Munki.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.munki.node</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/Node.js</string>
            <key>MUNKI_CATEGORY</key>
            <string>Development</string>
            <key>NAME</key>
            <string>node</string>
            <key>RELEASE</key>
            <string>latest-dubnium</string>
            <key>DISPLAY_NAME</key>
            <string>Node.js</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>blocking_applications</key>
                <array>
                    <string>node</string>
                    <string>npm</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>Node.js® is a platform built on Chrome's JavaScript runtime for easily building fast, scalable network applications.</string>
                <key>developer</key>
                <string>Node.js Foundation</string>
                <key>display_name</key>
                <string>%DISPLAY_NAME%</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.6.0</string>
        <key>ParentRecipe</key>
        <string>com.github.gerardkok.download.node</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>This recipe will be removed on July 19, 2026.</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>