<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple Computer//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Builds a package that install node and npm.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.pkg.node</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>node</string>
            <key>TYPE</key>
            <string>Stable</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.gerardkok.verify.node</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>PkgRootCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%</string>
                    <key>pkgdirs</key>
                    <dict/>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>FlatPkgUnpacker</string>
                <key>Arguments</key>
                <dict>
                    <key>flat_pkg_path</key>
                    <string>%pathname%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PackageInfoVersionFixer</string>
                <key>Arguments</key>
                <dict>
                    <key>packageinfo</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/local.pkg/PackageInfo</string>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>FlatPkgPacker</string>
                <key>Arguments</key>
                <dict>
                    <key>destination_pkg</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%/local.pkg</string>
                    <key>source_flatpkg_dir</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/local.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>FlatPkgPacker</string>
                <key>Arguments</key>
                <dict>
                    <key>destination_pkg</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%/npm.pkg</string>
                    <key>source_flatpkg_dir</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/npm.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>ProductBuilder</string>
                <key>Arguments</key>
                <dict>
                    <key>distribution</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/Distribution</string>
                    <key>resources</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/Resources</string>
                    <key>identifier</key>
                    <string>org.nodejs.node.pkg</string>
                    <key>package_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%</string>
                    <key>output_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
