<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download recipe for argocd.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.download.argocd</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>argocd</string>
            <key>ARCHITECTURE</key>
            <string>amd64</string>
            <!-- <string>arm64</string> -->
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.1</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>GitHubReleasesInfoProvider</string>
                <key>Arguments</key>
                <dict>
                    <key>asset_regex</key>
                    <string>argocd-darwin-%ARCHITECTURE%</string>
                    <key>github_repo</key>
                    <string>argoproj/argo-cd</string>
                    <key>sort_by_highest_tag_names</key>
                    <true/>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
