<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads Calibre and installs it.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.install.calibre</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Calibre</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.gerardkok.download.calibre</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>This recipe will be removed on July 19, 2026.</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>dmg_path</key>
                    <string>%pathname%</string>
                    <key>items_to_copy</key>
                    <array>
                        <dict>
                            <key>source_item</key>
                            <string>calibre.app</string>
                            <key>destination_path</key>
                            <string>/Applications</string>
                        </dict>
                    </array>
                </dict>
                <key>Processor</key>
                <string>InstallFromDMG</string>
            </dict>
        </array>
    </dict>
</plist>