<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download recipe for Rust.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.download.Rust</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Rust</string>
            <key>URL</key>
            <string>https://forge.rust-lang.org/other-installation-methods.html</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.3.1</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%URL%</string>
                    <key>re_pattern</key>
                    <string>(?P&lt;url&gt;https://static.rust-lang.org/dist/rust-(?P&lt;version&gt;[0-9\.]+)-x86_64-apple-darwin.pkg)</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%.pkg</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
