<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Imports the latest release of Jenkins into Munki.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.munki.Jenkins</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/Jenkins</string>
            <key>MUNKI_CATEGORY</key>
            <string>Developer</string>
            <key>NAME</key>
            <string>Jenkins</string>
            <key>JAVA_NAME</key>
            <string>OracleJava8</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>blocking_applications</key>
                <array/>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>An extendable open source automation server</string>
                <key>developer</key>
                <string>The Jenkins project</string>
                <key>display_name</key>
                <string>Jenkins</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <false/>
                <key>requires</key>
                <array>
                    <string>%JAVA_NAME%</string>
                </array>
                <key>installer_choices_xml</key>
                <!--
                Disable opening the Jenkins console in a browser as last step of the installer
                -->
                <array>
                    <dict>
                        <key>attributeSetting</key>
                        <integer>0</integer>
                        <key>choiceAttribute</key>
                        <string>selected</string>
                        <key>choiceIdentifier</key>
                        <string>choice10</string>
                    </dict>
                </array>
                <key>preinstall_script</key>
                <string>#!/bin/sh

/bin/launchctl unload /Library/LaunchDaemons/org.jenkins-ci.plist               
</string>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.3.1</string>
        <key>ParentRecipe</key>
        <string>com.github.gerardkok.download.Jenkins</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>flat_pkg_path</key>
                    <string>%pathname%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                </dict>
                <key>Processor</key>
                <string>FlatPkgUnpacker</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/Applications</string>
                    <key>pkgdirs</key>
                    <dict/>
                </dict>
                <key>Processor</key>
                <string>PkgRootCreator</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/jenkins.pkg/Payload</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/Applications/Jenkins</string>
                </dict>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>faux_root</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>installs_item_paths</key>
                    <array>
                        <string>/Applications/Jenkins/jenkins.war</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>MunkiInstallsItemsCreator</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>PathDeleter</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>version</key>
                        <string>%version%</string>
                    </dict>
                </dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>
