<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for YubiKeyPersonalizationTool.</string>
    <key>Identifier</key>
    <string>com.github.gerardkok.download.YubiKeyPersonalizationTool</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>YubiKeyPersonalizationTool</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://developers.yubico.com/yubikey-personalization-gui/Releases</string>
                <key>re_pattern</key>
                <string>href=\"(yubikey-personalization-gui-[0-9\.]+.pkg)\"</string>
                <key>result_output_var_name</key>
                <string>relative_download_url</string>
            </dict>
        </dict>       
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://developers.yubico.com/yubikey-personalization-gui/Releases/%relative_download_url%</string>
                <key>filename</key>
                <string>%NAME%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
              <key>input_path</key>
              <string>%pathname%</string>
              <key>expected_authority_names</key>
              <array>
                <string>Developer ID Installer: Yubico Limited</string>
                <string>Developer ID Certification Authority</string>
                <string>Apple Root CA</string>
              </array>
            </dict>
          </dict>
    </array>
</dict>
</plist>
