<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download recipe for YubiKey Authenticator.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.download.YubiKeyAuthenticator</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>YubiKeyAuthenticator</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.3.1</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://developers.yubico.com/yubioath-flutter/Releases/</string>
                    <key>re_pattern</key>
                    <string>href="yubico-authenticator-([\d\.]+)-mac.dmg"</string>
                    <key>result_output_var_name</key>
                    <string>version</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://developers.yubico.com/yubioath-flutter/Releases/yubico-authenticator-%version%-mac.dmg</string>
                    <key>filename</key>
                    <string>%NAME%-%version%.dmg</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/Yubico Authenticator.app</string>
                    <key>requirement</key>
                    <string>identifier "com.yubico.yubioath" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = LQA3CS5MM7</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
