<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download recipe for Devolo Cockpit.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.download.devolo-cockpit</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Devolo Cockpit</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>This recipe will be removed on July 19, 2026.</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://www.devolo.global/support/downloads/download/devolo-cockpit</string>
                    <key>re_pattern</key>
                    <string>Cockpit (?P&lt;version&gt;[0-9\.]+) -.*Mac.*?href=\"(?P&lt;url&gt;.*?-v[0-9-]+\.dmg)\"</string>
                    <key>re_flags</key>
                    <array>
                        <string>MULTILINE</string>
                        <string>DOTALL</string>
                    </array>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%.dmg</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/devolo Cockpit Installation.app</string>
                    <key>requirement</key>
                    <string>identifier "de.devolo.dLAN.CockpitInstaller" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "9HRJ64W5CY"</string>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
        </array>
    </dict>
</plist>
