<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads Devolo Cockpit and imports into Munki.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.munki.devolo-cockpit</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/devolo</string>
            <key>MUNKI_CATEGORY</key>
            <string>support</string>
            <key>NAME</key>
            <string>Devolo Cockpit</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>Devolo Cockpit a status monitor for a powerline network.</string>
                <key>developer</key>
                <string>devolo AG</string>
                <key>display_name</key>
                <string>devolo Cockpit</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.gerardkok.pkg.devolo-cockpit</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>FileCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>file_path</key>
                    <string>%RECIPE_CACHE_DIR%/uninstall_script</string>
                    <key>file_mode</key>
                    <string>0755</string>
                    <key>file_content</key>
                    <string>#!/bin/bash
    
"/Applications/devolo/devolo Cockpit uninstall.app/Contents/MacOS/uninstall"
                        
pkgutil --forget de.devolo.dLAN.Cockpit
                        
exit 0</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pkg_path%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                    <key>additional_makepkginfo_options</key>
                    <array>
                        <string>--uninstall_script</string>
                        <string>%RECIPE_CACHE_DIR%/uninstall_script</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PathDeleter</string>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/uninstall_script</string>
                    </array>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
