<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the Crystal Language and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.gerardkok.munki.Crystal</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Crystal</string>
        <key>MUNKI_CATEGORY</key>
        <string>Development</string>
        <key>NAME</key>
        <string>Crystal</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>&lt;html&gt;&lt;p&gt;Crystal is a programming language with the following goals:
                &lt;ul&gt;
                &lt;li&gt;Have a syntax similar to Ruby (but compatibility with it is not a goal).&lt;/li&gt;
                &lt;li&gt;Be statically type-checked, but without having to specify the type of variables or method arguments.&lt;/li&gt;
                &lt;li&gt;Be able to call C code by writing bindings to it in Crystal.&lt;/li&gt;
                &lt;li&gt;Have compile-time evaluation and generation of code, to avoid boilerplate code.&lt;/li&gt;
                &lt;li&gt;Compile to efficient native code.&lt;/li&gt;
                &lt;/ul&gt;
                &lt;/p&gt;&lt;/html&gt;</string>
            <key>developer</key>
            <string>Crystal Language</string>
            <key>display_name</key>
            <string>Crystal</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.gerardkok.download.Crystal</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>This recipe will be removed on July 19, 2026.</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
