<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download recipe for MySQL Community Server.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.download.MySQLCommunityServer</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>MySQLCommunityServer</string>
            <key>RELEASE</key>
            <string>8.0</string>
            <key>ARCHITECTURE</key>
            <!-- x86_64 or arm64 -->
            <string>x86_64</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.3.1</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>This recipe will be removed on July 19, 2026.</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://dev.mysql.com/downloads/mysql/%RELEASE%.html</string>
                    <key>re_pattern</key>
                    <string>\((?P&lt;rel_url&gt;mysql-(?P&lt;version&gt;[0-9\.]+)-.*-).*?dmg\)</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://dev.mysql.com/get/Downloads/MySQL-%RELEASE%/%rel_url%%ARCHITECTURE%.dmg</string>
                    <key>filename</key>
                    <string>%NAME%.dmg</string>
                    <key>request_headers</key>
                    <dict/>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
