<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Verifies the GPG signature of the latest version of MySQL Community Server.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.verify.MySQLCommunityServer</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>MySQLCommunityServer</string>
            <key>KEYID</key>
            <string>3A79BD29</string>
            <key>KEYSERVER</key>
            <string>hkps://pgp.mit.edu</string>
            <key>ARCHITECTURE</key>
            <!-- x86_64 or arm64 -->
            <string>x86_64</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.gerardkok.download.MySQLCommunityServer</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>http://dev.mysql.com/downloads/gpg/?file=%rel_url%%ARCHITECTURE%.dmg&amp;p=23</string>
                    <key>re_pattern</key>
                    <string>^(-----BEGIN PGP SIGNATURE-----.*-----END PGP SIGNATURE-----)$</string>
                    <key>re_flags</key>
                    <array>
                        <string>MULTILINE</string>
                        <string>DOTALL</string>
                    </array>
                    <key>result_output_var_name</key>
                    <string>gpg_signature</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>FileCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>file_content</key>
                    <string>%gpg_signature%</string>
                    <key>file_path</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg.asc</string>
                    <key>file_mode</key>
                    <string>644</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>com.github.autopkg.gerardkok-recipes.SharedProcessors/GPGSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>public_key_id</key>
                    <string>%KEYID%</string>
                    <key>keyserver</key>
                    <string>%KEYSERVER%</string>
                    <key>distribution_file</key>
                    <string>%pathname%</string>
                    <key>signature_file</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg.asc</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
