<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Imports the latest release of MySQL Community Server into Munki.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.munki.MySQLCommunityServer</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/MySQLCommunityServer</string>
            <key>MUNKI_CATEGORY</key>
            <string>Developer</string>
            <key>NAME</key>
            <string>MySQLCommunityServer</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>blocking_applications</key>
                <array/>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>The world's most popular open source database.</string>
                <key>developer</key>
                <string>Oracle</string>
                <key>display_name</key>
                <string>MySQL Community Server</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>installer_choices_xml</key>
                <array>
                    <dict>
                        <key>attributeSetting</key>
                        <integer>1</integer>
                        <key>choiceAttribute</key>
                        <string>selected</string>
                        <key>choiceIdentifier</key>
                        <string>com.mysql.server</string>
                    </dict>
                    <dict>
                        <key>attributeSetting</key>
                        <integer>0</integer>
                        <key>choiceAttribute</key>
                        <string>selected</string>
                        <key>choiceIdentifier</key>
                        <string>com.mysql.prefpane</string>
                    </dict>
                    <dict>
                        <key>attributeSetting</key>
                        <integer>0</integer>
                        <key>choiceAttribute</key>
                        <string>selected</string>
                        <key>choiceIdentifier</key>
                        <string>com.mysql.startupitem</string>
                    </dict>
                </array>       
                <key>unattended_install</key>
                <false/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.3.1</string>
        <key>ParentRecipe</key>
        <string>com.github.gerardkok.download.MySQLCommunityServer</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>
