<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download recipe for Python-virtualenv.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.download.Python-virtualenv</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>virtualenv</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>com.github.autopkg.gerardkok-recipes.SharedProcessors/PyPIInfoProvider</string>
                <key>Arguments</key>
                <dict>
                    <key>module</key>
                    <string>%NAME%</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%url%</string>
                    <key>filename</key>
                    <string>%NAME%.tar.gz</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
