<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Download recipe for Widelands.</string>
		<key>Identifier</key>
		<string>com.github.gerardkok.download.Widelands</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Widelands</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>GitHubReleasesInfoProvider</string>
				<key>Arguments</key>
				<dict>
					<key>asset_regex</key>
					<string>Widelands-[0-9\.]*-MacOS[0-9]*\.dmg</string>
					<key>github_repo</key>
					<string>widelands/widelands</string>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
