<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads Widelands and imports in into Munki.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.munki.Widelands</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>games/Widelands</string>
            <key>MUNKI_CATEGORY</key>
            <string>Games</string>
            <key>NAME</key>
            <string>Widelands</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>Widelands is a free, open source real-time strategy game with singleplayer campaigns and a multiplayer mode.</string>
                <key>developer</key>
                <string>Widelands Development Team</string>
                <key>display_name</key>
                <string>Widelands</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.gerardkok.download.Widelands</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>pkgdirs</key>
                    <dict/>
                </dict>
                <key>Processor</key>
                <string>PkgRootCreator</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%pathname%/Widelands.app</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/Widelands.app</string>
                </dict>
                <key>Processor</key>
                <string>Copier</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>plist</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/Widelands.app/Contents/Info.plist</string>
                </dict>
                <key>Processor</key>
                <string>OldStylePlistConverter</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_plist_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/Widelands.app/Contents/Info.plist</string>
                    <key>output_plist_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/Widelands.app/Contents/Info.plist</string>
                    <key>plist_data</key>
                    <dict>
                        <key>CFBundleShortVersionString</key>
                        <string>%version%</string>
                    </dict>
                </dict>
                <key>Processor</key>
                <string>PlistEditor</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>dmg_root</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>dmg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
                </dict>
                <key>Processor</key>
                <string>DmgCreator</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>PathDeleter</string>
            </dict>
        </array>
    </dict>
</plist>