<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of the Helm CLI. Set ARCH to either arm64 or x86_64.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.download.Helm</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Helm</string>
            <key>ARCH</key>
            <string>arm64</string>
        </dict>
        <key>MinimumVersion</key>
        <string>2.7.6</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>FindAndReplace</string>
                <key>Arguments</key>
                <dict>
                    <key>find</key>
                    <string>x86_64</string>
                    <key>input_string</key>
                    <string>%ARCH%</string>
                    <key>replace</key>
                    <string>amd64</string>
                    <key>result_output_var_name</key>
                    <string>PLATFORM_ARCH</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://github.com/helm/helm/releases</string>
                    <key>re_pattern</key>
                    <string>&lt;a href="(?P&lt;url&gt;https://get.helm.sh/helm-v(?P&lt;version&gt;[0-9\.]*)-darwin-%PLATFORM_ARCH%.tar.gz)".*&gt;MacOS %PLATFORM_ARCH%&lt;/a&gt;\s*\(.*/\s*(?P&lt;checksum&gt;[a-f0-9]*)\)</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%.tar.gz</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>io.github.hjuutilainen.SharedProcessors/ChecksumVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>algorithm</key>
                    <string>SHA256</string>
                    <key>checksum</key>
                    <string>%checksum%</string>
                    <key>checksum_pathname</key>
                    <string>%pathname%</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
