<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download recipe for the 1Password command-line tool.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.download.1PasswordCLI</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>1PasswordCLI</string>
            <key>PKG_ID</key>
            <string>com.1password.op</string>
            <key>SEARCH_URL</key>
            <string>https://app-updates.agilebits.com/product_history/CLI</string>
            <key>SEARCH_PATTERN</key>
            <string>href=\"(?P&lt;url&gt;https://cache.agilebits.com/dist/1P/op/pkg/v[0-9\.]+/op_darwin_amd64_v(?P&lt;version&gt;[0-9\.]+).pkg)\"</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%SEARCH_URL%</string>
                    <key>re_pattern</key>
                    <string>%SEARCH_PATTERN%</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%.pkg</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%</string>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: AgileBits Inc. (2BUA8C4S2C)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
        </array>
    </dict>
</plist>
