<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads drawio-desktop and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.gerardkok.munki.drawio-desktop</string>
    <key>Input</key>
    <dict>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>apps/drawio-desktop</string>
      <key>MUNKI_CATEGORY</key>
      <string>Development</string>
      <key>NAME</key>
      <string>drawio-desktop</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>blocking_applications</key>
        <array>
          <string>draw.io.app</string>
        </array>
        <key>category</key>
        <string>%MUNKI_CATEGORY%</string>
        <key>description</key>
        <string>drawio-desktop is a diagramming and whiteboarding desktop app.</string>
        <key>developer</key>
        <string>JGraph Ltd.</string>
        <key>display_name</key>
        <string>draw.io Desktop</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.peshay.download.draw.io</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>DeprecationWarning</string>
        <key>Arguments</key>
        <dict>
          <key>warning_message</key>
          <string>This recipe will be removed on July 19, 2026.</string>
        </dict>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pathname%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
      </dict>
    </array>
  </dict>
</plist>
